cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'

# core apps
brew 'coreutils'
brew 'bat'
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'git'
brew 'htop'
brew 'python3'
brew 'ripgrep'
brew 'tmux'
brew 'bash'
brew 'bash-completion'
brew 'zsh'
brew 'tree'
brew 'wget'
brew 'exa'

#brew 'youtube-dl'
#brew 'z'

# development
brew 'openssl'
brew 'go'
brew 'rust'
brew 'llvm'
# brew 'boost'

#brew 'cscope'
#brew 'gdb'
#brew 'libgit2'
#brew 'qt'
#brew 'renameutils'
#brew 'node'
#brew 'thrift'

