
# core apps
brew 'bash'
brew 'bash-completion'
brew 'bat'
brew 'coreutils'
brew 'curl'
brew 'exa'
brew 'fasd'
brew 'fd'
brew 'fzf'
brew 'gh'
brew 'git'
brew 'htop'
brew 'jq'
brew 'nvim'
brew 'python3'
brew 'ripgrep'
brew 'svn'
brew 'tmux'
brew 'tree'
brew 'vim'
brew 'wget'
brew 'zsh'

#brew 'youtube-dl'
#brew 'z'

# development
brew 'boost'
brew 'go'
brew 'llvm'
brew 'openssl'
brew 'rust'

#brew 'cscope'
#brew 'gdb'
#brew 'libgit2'
#brew 'qt'
#brew 'renameutils'
#brew 'node'
#brew 'thrift'

# cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'wez/wezterm'

cask 'wez/wezterm/wezterm'
cask 'linearmouse'
cask 'font-fira-code'
cask 'font-fira-code-nerd-font'
cask 'font-fira-mono'
cask 'font-fira-mono-for-powerline'
cask 'font-fira-mono-nerd-font'
cask 'font-jetbrains-mono'
cask 'font-jetbrains-mono-nerd-font'
cask 'font-source-code-pro'
cask 'font-source-code-pro-for-powerline'
