cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'puma/puma'

# Install brews
brew 'ack'
brew 'bash'
brew 'bash-completion'
brew 'boost'
brew 'coreutils'
brew 'diff-so-fancy'
brew 'gdb'
brew 'go'
brew 'grc'
brew 'libgit2'
brew 'openssl'
brew 'node'
brew 'readline'
brew 'renameutils'
brew 'python'
brew 'ripgrep'
brew 'spark'
brew 'thrift'
brew 'wget'
brew 'youtube-dl'
brew 'z'
#brew 'zsh'

# Install Casks
#cask '1password'
#cask 'dropbox'
#cask 'google-chrome'
#cask 'meld'
#cask 'the-unarchiver'
#cask 'vlc'
